/**
 * Created by chengyan on 2018.5.28
 * 枚举值表
 */

let enumerate = {

    // 功能模块枚举值
    serviceType: {
        "1": "建卡",
        "2": "预约挂号",
        "3": "加号取号",
        "4": "门诊缴费",
        "5": "住院缴费",
        "51": "住院清单",
        "52": "物价查询",
        "53": "报告单打印",
        "54": "条码打印",
        "55": "快捷出院",
        "61": "补打小票",
        "62": "订单查询",
        "97": "银行卡余额",
        "98": "视频问诊",
        "99": "科教视频",
        "100": "广告管理"
    },

    // 订单状态枚举值
    orderState: {
        '-2': "取消",
        '0': "待支付",
        '1': "已支付",
        '2': "待退款",
        "3": "退款中",
        "4": "已退款",
        "5": "退款失败"
    },

    // 问诊状态枚举值
    consultState: {
        "0": "待问诊",
        "1": "问诊中",
        "8": "完成",
        "9": "无效",
        "11": "中断"
    },

    // 时段枚举值
    period: {
        "am": "上午",
        "pm": "下午",
        "npm": "夜间",
        "all": "全天"
    },

    // 支付方式枚举值
    payMode: {
        "1": "微信扫码支付",
        "2": "支付宝扫码支付",
        "3": "银联支付"
    },

    // 卡类型
    cardType: {
        "1": "就诊卡",
        "2": "电子就诊卡",
        "3": "电子居民健康卡",
        "4": "居民健康卡",
        "5": "二代社保卡",
        "6": "输入就诊卡号",
        "7": "银联卡",
        "8": "身份证",
        "9": "人脸识别",
        // "10": "住院预缴的输入住院号"
    },

    // 查询方式
    queryWay: {
        "1": "扫描订单二维码",
        "2": "输入订单编号",
        "3": "输入住院号",
        "4": "就诊卡"
    },

    // 外设硬件枚举值表
    machinePart: {
        "1": "凭条打印",
        "2": "密码键盘",
        "3": "诊疗卡读卡取器",
        "4": "银联读卡器",
        "5": "报告单打印机",
        "6": "条码扫描器",
        "7": "摄像头",
        "8": "高拍仪",
        "9": "H5页面"
    },

    // 硬件外设错误表
    machineError: {
        "10000": "正常",
        "20001": "设备已坏",
        "20002": "少纸",
        "20003": "缺纸"
    },
    // 读卡错误状态
    readCardError: [
        "发送数据超时 ",
        "接收数据超时",
        "接收数据失败 ",
        "没有刷卡",
        "刷卡失败",
        "找不到设备",
        "打开设备失败",
        "设备已经关闭",
        "发送数据超时",
        "接受数据超时",
        "错误的包头",
        "错误的命令",
        "接受数据失败",
    ]
}
export default enumerate